[
      {
        "id": "CMPS151",
        "code": "CMPS 151",
        "name": "Programming Concepts",
        "credits": 3,
        "category": "Programming",
        "prerequisites": [],
        "description": "Introduction to programming concepts and fundamentals",
        "extraDescription": "This course provides a comprehensive introduction to programming using Python. Students will learn basic syntax, control structures, data types, and simple algorithms. The course emphasizes problem-solving skills and logical thinking. Hands-on exercises and small projects will help students apply concepts in practical scenarios.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "John Smith",
        "enrolled": 24
      },
      {
        "id": "CMPS251",
        "code": "CMPS 251",
        "name": "Object Oriented Programming",
        "credits": 4,
        "category": "Programming",
        "prerequisites": ["CMPS151"],
        "description": "Fundamentals of object-oriented programming paradigm",
        "extraDescription": "Building on basic programming skills, this course introduces object-oriented concepts using Java. Topics include classes, objects, inheritance, polymorphism, encapsulation, and abstraction. Students will design and implement medium-scale programs using OOP principles. The course also covers exception handling, file I/O, and basic GUI development.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Ahmed Al-Mansoori",
        "enrolled": 28
      },
      {
        "id": "CMPS200",
        "code": "CMPS 200",
        "name": "Computer Ethics",
        "credits": 1,
        "category": "Ethics",
        "prerequisites": [],
        "description": "Ethical issues related to computer usage and IT profession",
        "extraDescription": "This course examines ethical dilemmas in computing through case studies and discussions. Topics include intellectual property, privacy, security, professional responsibility, and societal impact of technology. Students will analyze real-world scenarios and develop frameworks for ethical decision-making in IT contexts. Guest speakers from industry will share practical experiences.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Sarah Johnson",
        "enrolled": 18
      },
      {
        "id": "CMPS205",
        "code": "CMPS 205",
        "name": "Discrete Structures",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": ["MATH101"],
        "description": "Mathematical structures for computer science",
        "extraDescription": "This foundational course covers mathematical concepts essential for computer science, including logic, set theory, relations, functions, combinatorics, and graph theory. Proof techniques such as induction and contradiction are emphasized. Applications to algorithm analysis and computer science problems are demonstrated throughout the course.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Khalid Al-Hamad",
        "enrolled": 22
      },
      {
        "id": "CMPS303",
        "code": "CMPS 303",
        "name": "Data Structures",
        "credits": 4,
        "category": "Programming",
        "prerequisites": ["CMPS251", "CMPS205"],
        "description": "Implementation and application of fundamental data structures",
        "extraDescription": "Students explore advanced data structures including linked lists, stacks, queues, trees, graphs, and hash tables. Algorithmic analysis using Big-O notation is covered in depth. The course includes extensive programming assignments implementing these structures and analyzing their performance characteristics. Practical applications in problem-solving are emphasized.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Michael Brown",
        "enrolled": 26
      },
      {
        "id": "CMPS307",
        "code": "CMPS 307",
        "name": "Introduction to Project Management and Entrepreneurship",
        "credits": 2,
        "category": "Management",
        "prerequisites": [],
        "description": "Basic principles of project management and entrepreneurship in IT",
        "extraDescription": "This practical course covers project lifecycle management, Agile methodologies, team dynamics, and entrepreneurial thinking in IT. Students work in teams to develop project plans, create business models, and present technology solutions. Case studies of successful tech startups are analyzed, and students develop their own project proposals.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Noora Al-Thani",
        "enrolled": 20
      },
      {
        "id": "CMPS310",
        "code": "CMPS 310",
        "name": "Software Engineering",
        "credits": 4,
        "category": "Software Development",
        "prerequisites": ["CMPS303"],
        "description": "Software development methodologies and practices",
        "extraDescription": "Comprehensive coverage of software engineering principles including requirements analysis, system design, implementation, testing, and maintenance. Students work in teams to develop a medium-scale software project using modern tools and methodologies. Topics include UML modeling, design patterns, version control, continuous integration, and software metrics.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "James Wilson",
        "enrolled": 25
      },
      {
        "id": "CMPS323",
        "code": "CMPS 323",
        "name": "Design & Analysis of Algorithms",
        "credits": 3,
        "category": "Programming",
        "prerequisites": ["CMPS303"],
        "description": "Algorithm design paradigms and complexity analysis",
        "extraDescription": "Advanced study of algorithm design techniques including divide-and-conquer, dynamic programming, greedy algorithms, and backtracking. Complexity classes P and NP are introduced. Students implement and analyze algorithms for sorting, searching, graph problems, and optimization. The course emphasizes both theoretical foundations and practical implementation considerations.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Abdullah Al-Khalifa",
        "enrolled": 23
      },
      {
        "id": "CMPS350",
        "code": "CMPS 350",
        "name": "Web Development Fundamentals",
        "credits": 3,
        "category": "Web Development",
        "prerequisites": ["CMPS251"],
        "description": "Principles and technologies of web application development",
        "extraDescription": "Hands-on course covering full-stack web development. Front-end technologies include HTML5, CSS3, JavaScript, and modern frameworks like React. Back-end development focuses on Node.js, Express, and database integration. RESTful API design, authentication, and deployment strategies are covered. Students complete several projects culminating in a full-featured web application.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Emily Davis",
        "enrolled": 27
      },
      {
        "id": "CMPS351",
        "code": "CMPS 351",
        "name": "Fundamentals of Database",
        "credits": 4,
        "category": "Databases",
        "prerequisites": ["CMPS251"],
        "description": "Database design, implementation and management",
        "extraDescription": "Comprehensive study of database systems covering relational theory, SQL, normalization, transactions, and indexing. Students design and implement databases using systems like MySQL and PostgreSQL. Advanced topics include NoSQL databases, distributed systems, and big data concepts. A major project involves designing and implementing a database for a real-world scenario.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Mohammed Al-Sada",
        "enrolled": 24
      },
      {
        "id": "CMPS380",
        "code": "CMPS 380",
        "name": "Cybersecurity Fundamentals",
        "credits": 3,
        "category": "Security",
        "prerequisites": ["CMPS303"],
        "description": "Introduction to computer and network security principles",
        "extraDescription": "This course provides a broad overview of cybersecurity concepts including cryptography, authentication, access control, network security, and secure coding practices. Hands-on labs cover penetration testing, vulnerability assessment, and security tool usage. Legal and ethical aspects of cybersecurity are discussed, along with current threat landscapes and defense strategies.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Thomas Anderson",
        "enrolled": 19
      },
      {
        "id": "CMPS405",
        "code": "CMPS 405",
        "name": "Operating Systems",
        "credits": 4,
        "category": "Systems",
        "prerequisites": ["CMPS303", "CMPE263"],
        "description": "Design and implementation of operating systems",
        "extraDescription": "In-depth study of operating system concepts including process management, memory management, file systems, and I/O. Students explore these concepts through programming assignments modifying a small instructional operating system. Topics include concurrency, synchronization, scheduling algorithms, virtualization, and distributed systems. Performance tuning and security considerations are emphasized.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Fatima Al-Nuaimi",
        "enrolled": 21
      },
      {
        "id": "CMPS493",
        "code": "CMPS 493",
        "name": "Senior Project I",
        "credits": 3,
        "category": "Project",
        "prerequisites": ["CMPS310"],
        "additionalRequirements": "Must complete min 84 credit hours and either CMPS350 or CMPS405",
        "description": "First part of the capstone project",
        "extraDescription": "First semester of the two-part capstone experience. Students work in teams to identify, design, and plan a substantial software project under faculty supervision. Deliverables include requirements specification, system design documents, project plan, and prototype implementation. Regular progress reports and presentations are required. Projects often involve real clients from industry or academia.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Richard Taylor",
        "enrolled": 15
      },
      {
        "id": "CMPS499",
        "code": "CMPS 499",
        "name": "Senior Project II",
        "credits": 3,
        "category": "Project",
        "prerequisites": ["CMPS493"],
        "description": "Continuation and completion of the capstone project",
        "extraDescription": "Second semester of the capstone experience where students complete implementation, testing, and deployment of their projects. Emphasis is on professional practices including documentation, version control, quality assurance, and user acceptance testing. Students present their work in a public forum and deliver final documentation including user manuals and maintenance guides.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Mariam Al-Kuwari",
        "enrolled": 15
      },
      {
        "id": "CMPE263",
        "code": "CMPE 263",
        "name": "Computer Architecture & Organization I",
        "credits": 3,
        "category": "Hardware",
        "prerequisites": ["CMPS251"],
        "description": "Fundamentals of computer organization and architecture",
        "extraDescription": "Study of computer system organization from the gate level up to complete processors. Topics include digital logic, instruction set architecture, processor datapath and control, memory hierarchy, and I/O systems. Assembly language programming and performance analysis are covered. Labs involve programming FPGAs and simulating computer components.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Paul Miller",
        "enrolled": 20
      },
      {
        "id": "CMPE355",
        "code": "CMPE 355",
        "name": "Data Communication & Networks I",
        "credits": 4,
        "category": "Networking",
        "prerequisites": ["CMPS303"],
        "description": "Principles of data communications and computer networks",
        "extraDescription": "Comprehensive introduction to computer networks covering the OSI and TCP/IP models. Detailed study of physical layer, data link layer, network layer, and transport layer protocols. Hands-on labs include network configuration, packet analysis, and socket programming. Emerging technologies like software-defined networking and network function virtualization are introduced.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Ali Al-Sulaiti",
        "enrolled": 22
      },
      {
        "id": "MATH101",
        "code": "MATH 101",
        "name": "Calculus I",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": [],
        "description": "Limits, derivatives, integrals and applications",
        "extraDescription": "First course in the calculus sequence covering limits, continuity, derivatives, and basic integration. Applications include optimization problems, related rates, and area calculations. The course emphasizes both computational skills and conceptual understanding. Technology tools like graphing calculators or computer algebra systems are used to enhance learning.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Jennifer Lee",
        "enrolled": 30
      },
      {
        "id": "MATH102",
        "code": "MATH 102",
        "name": "Calculus II",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": ["MATH101"],
        "description": "Techniques of integration, infinite series, and applications",
        "extraDescription": "Continuation of Calculus I covering advanced integration techniques, applications of integration, sequences and series, and parametric equations. Topics include integration by parts, partial fractions, improper integrals, Taylor series, and polar coordinates. Applications to physics and engineering problems are emphasized throughout the course.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Ibrahim Al-Emadi",
        "enrolled": 28
      },
      {
        "id": "MATH231",
        "code": "MATH 231",
        "name": "Linear Algebra",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": ["MATH101"],
        "description": "Vector spaces, linear transformations, matrices, and systems of equations",
        "extraDescription": "Introduction to linear algebra covering systems of linear equations, matrix algebra, determinants, vector spaces, linear transformations, eigenvalues and eigenvectors. Applications to computer graphics, network analysis, and data science are presented. The course emphasizes both theoretical foundations and computational techniques using mathematical software.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Daniel White",
        "enrolled": 25
      },
      {
        "id": "GENG200",
        "code": "GENG 200",
        "name": "Probability & Statistics",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": ["MATH102"],
        "description": "Probability theory and statistical methods for engineering",
        "extraDescription": "Fundamentals of probability theory, random variables, probability distributions, and statistical inference. Topics include descriptive statistics, hypothesis testing, regression analysis, and ANOVA. Engineering applications in quality control, reliability, and data analysis are emphasized. Students use statistical software for data analysis projects.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Aisha Al-Thani",
        "enrolled": 23
      },
      {
        "id": "GENG300",
        "code": "GENG 300",
        "name": "Numerical Methods",
        "credits": 3,
        "category": "Mathematics",
        "prerequisites": ["MATH231", "CMPS151"],
        "description": "Numerical techniques for solving engineering problems",
        "extraDescription": "Study of numerical algorithms for solving mathematical problems in engineering. Topics include solutions of equations, interpolation, numerical differentiation and integration, solutions of differential equations, and matrix computations. Error analysis and algorithm stability are emphasized. Programming assignments implement numerical methods to solve practical engineering problems.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Christopher Harris",
        "enrolled": 20
      },
      {
        "id": "PHYS191",
        "code": "PHYS 191",
        "name": "General Physics for Engineering I",
        "credits": 3,
        "category": "Physics",
        "prerequisites": [],
        "description": "Mechanics, thermodynamics, and waves for engineering students",
        "extraDescription": "First course in the physics sequence for engineers covering Newtonian mechanics, work and energy, rotational dynamics, oscillations, and mechanical waves. The course emphasizes problem-solving skills and applying physical principles to engineering contexts. Calculus is used throughout. Demonstrations and applications to real-world engineering problems are integrated into lectures.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Yousef Al-Mohannadi",
        "enrolled": 29
      },
      {
        "id": "PHYS192",
        "code": "PHYS 192",
        "name": "Experimental General Physics for Engineering I",
        "credits": 1,
        "category": "Physics",
        "prerequisites": [],
        "corequisites": ["PHYS191"],
        "description": "Laboratory experiments in mechanics and thermodynamics",
        "extraDescription": "Hands-on laboratory course complementing PHYS 191. Experiments cover measurement techniques, motion, forces, energy, momentum, rotational dynamics, and thermodynamic principles. Students learn experimental design, data analysis, error estimation, and scientific reporting. Modern measurement technologies and computer-aided data acquisition are introduced.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Elizabeth Taylor",
        "enrolled": 28
      },
      {
        "id": "PHYS193",
        "code": "PHYS 193",
        "name": "General Physics for Engineering II",
        "credits": 3,
        "category": "Physics",
        "prerequisites": ["PHYS191"],
        "description": "Electricity, magnetism, and optics for engineering students",
        "extraDescription": "Second course in the physics sequence covering electrostatics, circuits, magnetism, electromagnetic waves, and geometric optics. The course emphasizes applications to electrical engineering and related fields. Problem-solving skills are developed through extensive practice with both conceptual and quantitative problems. Modern applications in technology are discussed.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Hamad Al-Naimi",
        "enrolled": 26
      },
      {
        "id": "PHYS194",
        "code": "PHYS 194",
        "name": "Experimental General Physics for Engineering II",
        "credits": 1,
        "category": "Physics",
        "prerequisites": ["PHYS192"],
        "corequisites": ["PHYS193"],
        "description": "Laboratory experiments in electricity, magnetism, and optics",
        "extraDescription": "Laboratory course complementing PHYS 193. Experiments cover electric fields and potentials, DC and AC circuits, magnetic fields, electromagnetic induction, and optical phenomena. Students develop skills in circuit construction, instrumentation, and data analysis. Modern measurement techniques and equipment used in engineering practice are emphasized.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Sophia Clark",
        "enrolled": 25
      },
      {
        "id": "CHEM101",
        "code": "CHEM 101",
        "name": "General Chemistry I",
        "credits": 3,
        "category": "Chemistry",
        "prerequisites": [],
        "description": "Basic principles of chemistry for engineering students",
        "extraDescription": "Introduction to fundamental chemical principles including atomic structure, chemical bonding, stoichiometry, states of matter, and thermodynamics. The course emphasizes applications to materials science and engineering problems. Problem-solving skills are developed through extensive practice with quantitative chemical problems and conceptual understanding.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Nasser Al-Remaihi",
        "enrolled": 27
      },
      {
        "id": "CHEM103",
        "code": "CHEM 103",
        "name": "Experimental General Chemistry I",
        "credits": 1,
        "category": "Chemistry",
        "prerequisites": [],
        "corequisites": ["CHEM101"],
        "description": "Laboratory experiments in general chemistry",
        "extraDescription": "Hands-on laboratory course complementing CHEM 101. Experiments cover measurement techniques, chemical reactions, stoichiometry, gas laws, calorimetry, and solution chemistry. Emphasis is placed on laboratory safety, precise measurement techniques, data analysis, and scientific reporting. Students learn to maintain laboratory notebooks and write formal reports.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Amanda Roberts",
        "enrolled": 26
      },
      {
        "id": "DAWA111",
        "code": "DAWA 111",
        "name": "Islamic Culture",
        "credits": 3,
        "category": "Islamic Studies",
        "prerequisites": [],
        "description": "Fundamentals of Islamic culture and thought",
        "extraDescription": "Comprehensive study of Islamic civilization covering historical development, philosophical thought, scientific contributions, and artistic achievements. The course examines Islam's influence on world cultures and its contemporary manifestations. Field trips to cultural sites and interactions with scholars provide practical insights into Islamic heritage and modern practice.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Khalifa Al-Malki",
        "enrolled": 30
      },
      {
        "id": "ARAB100",
        "code": "ARAB 100",
        "name": "Arabic Language I",
        "credits": 3,
        "category": "Arabic",
        "prerequisites": [],
        "description": "Arabic language skills and literature",
        "extraDescription": "Introductory course in Modern Standard Arabic covering basic grammar, vocabulary, reading, writing, and conversation skills. Cultural aspects of Arab societies are integrated into language learning. The course emphasizes practical communication skills while developing appreciation for Arabic literature and linguistic heritage. Multimedia resources enhance learning.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Sarah Johnson",
        "enrolled": 28
      },
      {
        "id": "ENGL202",
        "code": "ENGL 202",
        "name": "English Language I",
        "credits": 3,
        "category": "English",
        "prerequisites": [],
        "description": "Advanced English language skills for academic purposes",
        "extraDescription": "Advanced English course focusing on academic reading, writing, listening, and speaking skills. Students analyze academic texts, write research papers, and develop presentation skills. The course emphasizes critical thinking, proper citation methods, and effective communication in academic contexts. Individualized feedback helps students refine their language proficiency.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Fahad Al-Hajri",
        "enrolled": 30
      },
      {
        "id": "ENGL203",
        "code": "ENGL 203",
        "name": "English Language II",
        "credits": 3,
        "category": "English",
        "prerequisites": ["ENGL202"],
        "description": "Advanced academic writing and communication skills",
        "extraDescription": "Continuation of English Language I with emphasis on advanced composition, professional communication, and research skills. Students produce technical reports, proposals, and professional correspondence. The course includes debate and negotiation exercises, and focuses on refining grammatical accuracy and stylistic sophistication in written and spoken English.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Jessica Brown",
        "enrolled": 27
      },
      {
        "id": "HIST121",
        "code": "HIST 121",
        "name": "History of Qatar",
        "credits": 3,
        "category": "History",
        "prerequisites": [],
        "description": "Comprehensive study of Qatar's history and development",
        "extraDescription": "In-depth exploration of Qatar's history from ancient times to the present, covering political, economic, social, and cultural developments. The course examines Qatar's transformation into a modern state, its relations with neighboring countries, and its role in global affairs. Field trips to historical sites and archives complement classroom learning.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Abdulrahman Al-Thani",
        "enrolled": 25
      },
      {
        "id": "MAGT101",
        "code": "MAGT 101",
        "name": "Principles of Management",
        "credits": 3,
        "category": "Management",
        "prerequisites": [],
        "description": "Introduction to management theories and practices",
        "extraDescription": "Foundational course covering the four functions of management: planning, organizing, leading, and controlling. Topics include organizational behavior, decision-making, human resource management, and strategic planning. Case studies of real businesses, guest lectures from industry leaders, and team projects provide practical application of management concepts.",
        "status": "Open",
        "registrationOpen": true,
        "instructor": "Matthew Wilson",
        "enrolled": 22
      }
    ]